Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: We hope you’ll give our VS Code extension a try and look forward to getting feedback. A huge thanks goes out to the many contributors on https://github.com/redhat-developer/vscode-quarkus[redhat-developer/vscode-quarkus], https://github.com/redhat-developer/vscode-microprofile[redhat-developer/vscode-microprofile], https://github.com/redhat-developer/quarkus-ls[redhat-developer/quarkus-ls], https://github.com/eclipse/lsp4mp[eclipse/lsp4mp], https://github.com/redhat-developer/vscode-java[redhat-developer/vscode-java], and https://github.com/eclipse/eclipse.jdt.ls[eclipse/eclipse.jdt.ls], who have helped get the project to where it is today. Stay tuned for our post on the new Qute features that have been added.
ja_jp: VS Code エクステンションをお試しいただき、フィードバックをお待ちしています。 link:https://github.com/redhat-developer/vscode-quarkus[redhat-developer/vscode-quarkus], link:https://github.com/redhat-developer/vscode-microprofile[redhat-developer/vscode-microprofile], link:https://github.com/redhat-developer/quarkus-ls[redhat-developer/quarkus-ls], link:https://github.com/eclipse/lsp4mp[eclipse/lsp4mp], link:https://github.com/redhat-developer/vscode-java[redhat-developer/vscode-java] そして link:https://github.com/eclipse/eclipse.jdt.ls[eclipse/eclipse.jdt.ls] の多くの貢献者に感謝します。新たに追加されたQuteの機能についての投稿をお楽しみに。

source: We host a biweekly Quarkus Community Call at 2PM (Paris time) to discuss technical topics and project updates. To attend, <a href="https://calendar.google.com/calendar/embed?src=935090aaae38be35eda437d018782b7827f3770f7a0344013677acd861570b20%40group.calendar.google.com&ctz=Europe%2FParis" target="blank">view the calendar</a> or <a href="https://calendar.google.com/calendar/ical/935090aaae38be35eda437d018782b7827f3770f7a0344013677acd861570b20%40group.calendar.google.com/public/basic.ics">subscribe (iCal)</a> to the calendar so you don't miss one. The calls are posted to Youtube you can view the <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVZ_rG48SFUFpEyTYGai0YLw" target="blank">Community Call Playlist</a> to access all of the calls.
ja_jp: Quarkus コミュニティーコールを隔週で午後 2 時 (パリ時間) に開催し、技術的なトピックやプロジェクトの更新について議論しています。参加するには、<a href="https://calendar.google.com/calendar/embed?src=935090aaae38be35eda437d018782b7827f3770f7a0344013677acd861570b20%40group.calendar.google.com&ctz=Europe%2FParis" target="blank">カレンダーを表示</a>するか、<a href="https://calendar.google.com/calendar/ical/935090aaae38be35eda437d018782b7827f3770f7a0344013677acd861570b20%40group.calendar.google.com/public/basic.ics">カレンダーを購読 (iCal)</a> して見逃さないようにしてください。通話は YouTube に投稿されており、すべての通話にアクセスするには <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVZ_rG48SFUFpEyTYGai0YLw" target="blank">コミュニティーコールプレイリスト</a> を表示できます。

source: We improved a lot on the AWT support in native executables and you now have a dedicated extension for that `quarkus-awt`. Add it to your application if you are doing AWT work in native.
ja_jp: ネイティブ実行可能ファイルでのAWTサポートを大幅に改善し、そのための専用エクステンション `quarkus-awt` を用意しました。 ネイティブでAWTの作業を行う場合は、アプリケーションに追加してください。

source: We improved the customization abilities of several extensions:
ja_jp: いくつかのエクステンションのカスタマイズ能力を向上させました:

source: We index the book's ID, so it can be projected (see below).
ja_jp: book の ID のインデックスを作成して、ID が表示されるようにします (以下を参照)。

source: We indicate that we are searching for ``Author``s.
ja_jp: `Author` を検索していることを示しています。

source: We initially wanted sub-second response times for most of the API, and be able to handle around 10 thousand requests per second. With zero optimizations, our app was responding within 1ms for most APIs, and easily surpassed our throughput requirements. This is way more than we will need for the foreseeable future. The Quarkus app also uses less than half the CPU time [compared to Node.js], despite handling more traffic and providing more functionality.
ja_jp: 当初は、ほとんどのAPIで1秒以下のレスポンスタイムを実現し、1秒間に約1万件のリクエストを処理できるようにしたいと考えていました。最適化を一切行わなかったにもかかわらず、ほとんどのAPIで1ms以内に応答するようになり、要求していたスループットを簡単に上回ることができました。これは、予測可能な将来に必要とされる数をはるかに上回るものです。また、Quarkusのアプリは、より多くのトラフィックを処理し、より多くの機能を提供しているにもかかわらず、（Node.jsと比較して）半分以下のCPU時間しか使用していません。

source: We inject an Elasticsearch `RestHighLevelClient` inside the service.
ja_jp: サービス内部にElasticsearch `RestHighLevelClient` を注入しています。

source: We inject an Elasticsearch low level `RestClient` into our service.
ja_jp: Elasticsearch の低レベル `RestClient` をサービスに注入しています。

source: We inject an `ElasticsearchClient` inside the service.
ja_jp: サービス内部に `ElasticsearchClient` を注入します。

source: We introduced a new MicroProfile REST Client based on RESTEasy Reactive.
ja_jp: RESTEasy Reactiveをベースにした新しいMicroProfile REST Clientを導入しました。

source: We introduced a reactive counterpart to the OIDC token propagation extension, that you can use with RESTEasy Reactive.
ja_jp: RESTEasy Reactiveで使用できる、OIDCトークン伝搬エクステンションのリアクティブ対応版を導入しました。

source: We introduced custom JAR packagings designed to improve startup time.
ja_jp: 起動時間を改善するために設計されたカスタムJARパッケージを導入しました。

source: We just need to run the application using:
ja_jp: 以下を使ってアプリケーションを実行するだけです:

source: We just released 1.13.2.Final, a new maintenance release for the 1.13 release train.
ja_jp: 1.13リリーストレインの新しいメンテナンスリリースである1.13.2.Finalをリリースしました。

source: We just released 1.13.3.Final, a new maintenance release for the 1.13 release train.
ja_jp: 1.13リリーストレインの新しいメンテナンスリリースである1.13.3.Finalをリリースしました。

source: We just released 1.13.4.Final, a new maintenance release for the 1.13 release train.
ja_jp: 1.13リリーストレインの新しいメンテナンスリリースである1.13.4.Finalをリリースしました。

source: We just released Quarkus 2.0.1.Final, our first maintenance release on top of 2.0.
ja_jp: Quarkus 2.0.1.Finalをリリースしました。

source: We just released Quarkus 2.0.2.Final because we like symmetry (and also because we had a couple of bugfixes to publish).
ja_jp: Quarkus 2.0.2.Finalをリリースしたのは、対称性を重視したためです（そして多くのバグフィックスもあった為です）。

source: We just released Quarkus 2.0.3.Final with a new round of bugfixes and documentation improvements.
ja_jp: Quarkus 2.0.3.Finalがリリースされました。新しいバグフィックスとドキュメントの改善が行われています。

source: We just released Quarkus 2.1.1.Final, our first maintenance release on top of 2.1.
ja_jp: 2.1の最初のメンテナンスリリースであるQuarkus 2.1.1.Finalをリリースしました。

source: We just released Quarkus 2.1.2.Final, our second maintenance release on top of 2.1.
ja_jp: 2.1 の上に 2 回目のメンテナンス リリースである Quarkus 2.1.2.Final をリリースしました。

source: We just released Quarkus 2.1.3.Final, our third maintenance release on top of 2.1.
ja_jp: Quarkus 2.1.3.Finalをリリースしました。2.1における3回目のメンテナンスリリースです。

source: We just released Quarkus 2.1.4.Final, our fourth (and probably last!) maintenance release on top of 2.1.
ja_jp: Quarkus 2.1.4.Finalをリリースしました。これは2.1の4回目の（そしておそらく最後の）メンテナンスリリースです。

source: We just released Quarkus 2.4.1.Final, a maintenance release for our 2.4 release train containing bugfixes and documentation improvements.
ja_jp: Quarkus 2.4.1.Finalがリリースされました。このリリースは、2.4リリーストレインのメンテナンスリリースで、バグフィックスとドキュメントの改善を含んでいます。

source: We just released Quarkus 2.5.2.Final, a maintenance release for our 2.5 release train containing bugfixes and documentation improvements.
ja_jp: Quarkus 2.5.2.Finalがリリースされました。このリリースは、2.5リリーストレインのメンテナンスリリースで、バグフィックスとドキュメントの改善を含んでいます。

source: We just released Quarkus 2.5.3.Final, a maintenance release for our 2.5 release train containing bugfixes and documentation improvements.
ja_jp: Quarkus 2.5.3.Finalは、バグ修正とドキュメントの改善を含む、Quarkus 2.5リリーストレインのメンテナンスリリースです。

source: We just released Quarkus 2.5.4.Final, a maintenance release for our 2.5 release train containing bugfixes and documentation improvements.
ja_jp: Quarkus 2.5.4.Finalがリリースされました。このリリースは、2.5リリーストレインのメンテナンスリリースで、バグフィックスとドキュメントの改善が含まれています。

source: We just released Quarkus 2.6.2.Final, our second maintenance release for our 2.6 release train.
ja_jp: Quarkus 2.6.2.Finalがリリースされました。2.6リリーストレインの2番目のリリースです。

source: We just released Quarkus 2.6.3.Final with a new round of bugfixes and documentation improvements.
ja_jp: Quarkus 2.6.3.Finalがリリースされました。バグフィックスとドキュメントの改善が行われています。

source: We just released Quarkus 2.7.4.Final with a new round of bugfixes and documentation improvements.
ja_jp: Quarkus 2.7.4.Finalをリリースし、バグフィックスとドキュメントの改善を行いました。

source: We just released Quarkus 2.8.3.Final which is the third and probably last maintenance release for our 2.8 release train. 2.9.0.Final will be released next week.
ja_jp: Quarkus 2.8.3.Finalをリリースしました。これは、2.8リリーストレインの3つ目で、おそらく最後のメンテナンスリリースです。2.9.0.Finalは来週リリースされる予定です。

source: We just released Quarkus 2.9, which comes packed with new features:
ja_jp: 新機能を満載したQuarkus 2.9をリリースしました:

source: We just released our second Alpha for Quarkus 2.0.
ja_jp: Quarkus 2.0の2回目のアルファ版をリリースしました。

source: We just released our third Alpha for Quarkus 2.0 which contains several enhancements and new features:
ja_jp: Quarkus 2.0の3番目のアルファ版をリリースしました。いくつもの機能強化と新機能を含みます。

source: We just started the candidate release cycle for 2.0.0.Final.
ja_jp: 2.0.0.Finalの候補リリースサイクルを開始しました。

source: We keep the Migration Guide up to date here: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.0.
ja_jp: 最新のマイグレーションガイドはこちらです: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.0.

source: We keep track of their compatibility with the latest versions of Quarkus thanks to the Ecosystem CI and https://status.quarkus.io/#quarkiverse[status.quarkus.io].
ja_jp: Ecosystem CIと link:https://status.quarkus.io/#quarkiverse[status.quarkus.io]により、Quarkusの最新バージョンとの互換性を追跡しています。

source: We knew that moving some of these endpoints, like metrics and health, would be problematic for already deployed applications and human muscle memory. To ease the transition, we added redirects for some of these endpoints, so that if you visited `/metrics` you would be redirected to `/q/metrics`.
ja_jp: 私たちは、メトリクスやヘルスなどのエンドポイントの一部を移動することは、すでに展開されているアプリケーションや人間の記憶にとって問題があることを知っていました。移行を容易にするために、これらのエンドポイントの一部にリダイレクトを追加し、 `/metrics` にアクセスした場合は `/q/metrics` にリダイレクトされるようにしました。

source: We load some initial data on startup (see <<automatic-import-script>>).
ja_jp: 起動時にいくつかの初期データをロードします (<<automatic-import-script>> 参照)。

source: We load some initial data on startup.
ja_jp: いくつかの初期データを読み込みます。

source: We load some initial data.
ja_jp: 初期データを読み込みます。

source: We make building native executable using SSL easy, and provide several options to cope well with different types of security requirements.
ja_jp: 私たちは、SSLを使ったネイティブ実行可能ファイルのビルドを容易にし、様々なタイプのセキュリティ要件に対処するための複数のオプションを提供します。

source: We mark a (single) constructor as a `@ProjectionConstructor`, so that an `Author` instance can be reconstructed from the content of the index.
ja_jp: (単一の) コンストラクターを `@ProjectionConstructor` としてマークします。 これにより、インデックスの内容から `Author` インスタンスを再構築できるようにします。

source: We mark this property with `@JsonIgnore` to avoid infinite loops when serializing with Jackson.
ja_jp: このプロパティを `@JsonIgnore` でマークしてJacksonでシリアル化する際の無限ループを避けます。

source: We meant to do it this week but a case of covid made us take a small break! Instead we will do it on the coming Monday.
ja_jp: 今週中にやるつもりだったのですが、covidにかかったため、少しお休みさせていただきました。その代わり、来週の月曜日に行う予定です。

source: We modified the `MovieResourceTest` that was generated together with the project. This test class has a subclass, `NativeMovieResourceIT`, that runs the same test against the native executable. To run it, execute:
ja_jp: プロジェクトと一緒に生成された `MovieResourceTest` を変更しました。このテストクラスには、ネイティブ実行可能ファイルに対して同じテストを実行するサブクラ ス`NativeMovieResourceIT` があります。実行するには、次を実行します。

source: We must obtain an instance of the `legacyTracer`. The Shim includes a utility class for this purpose: `Tracer legacyTracer = OpenTracingShim.createTracerShim(openTelemetry);`
ja_jp: `legacyTracer` のインスタンスを取得する必要があります。シムには、この目的のためのユーティリティークラスが含まれています: `Tracer legacyTracer = OpenTracingShim.createTracerShim(openTelemetry);`

source: We need a PostgreSQL instance and an Elasticsearch cluster.
ja_jp: PostgreSQLインスタンスとElasticsearchクラスターが必要です。

source: We need a consumer listening on the `greeting` address. This consumer can be in the same class or another bean such as:
ja_jp: `greeting` のアドレスをリッスンするコンシューマーが必要です。このコンシューマーは、同じクラスでも、次のような別のBeanでも構いません。

source: We need more Extension codestarts!
ja_jp: もっとエクステンションのcodestartsが必要です!

source: We need something to exchange. Without much originality, let's say we will send and receive `Movie` objects. In your project, create the `org.acme.Movie` class with the following content:
ja_jp: 交換するものが必要です。あまりオリジナリティを持たずに、 `Movie` オブジェクトを送受信するとしましょう。プロジェクトの中で、以下の内容の `org.acme.Movie` クラスを作成します:

source: We need to add an extension to our project to add the capability to build container images:
ja_jp: コンテナーイメージをビルドする機能を追加するには、プロジェクトにエクステンションを追加する必要があります。

source: We need to add an extension to our project to build container images via the Quarkus Maven plugin:
ja_jp: Quarkus Mavenプラグインを使ってコンテナイメージを構築するために、プロジェクトにエクステンションを追加する必要があります。

source: We need to configure the Artemis connection properties. This is done in the `src/main/resources/application.properties` file.
ja_jp: Artemis の接続プロパティーを設定する必要があります。これは `src/main/resources/application.properties` ファイルで行います。

source: We need to configure the Qpid JMS properties used by the extension when injecting the ConnectionFactory.
ja_jp: ConnectionFactoryを注入する際にエクステンションで使用するQpid JMSプロパティーを設定する必要があります。

source: We need to configure the application to indicate where the `hello` service is found. In the `src/main/resources/application.properties` file, add the following property:
ja_jp: `hello` サービスがどこにあるかを示すようにアプリケーションを構成する必要があります。 `src/main/resources/application.properties` ファイルで、以下のプロパティーを追加します。

source: We need to customize the `pom.xml` file to use virtual threads.
ja_jp: 仮想スレッドを使うためには、 `pom.xml` ファイルをカスタマイズする必要があります。

source: We need to include additional resources and metadata.
ja_jp: 追加のリソースとメタデータを含める必要があります。

source: We need to tell Hibernate Search about the structure of our entities.
ja_jp: Hibernate Search にエンティティーの構造を伝える必要があります。

source: We need to tell Hibernate Search about the version of Elasticsearch we will use.
ja_jp: 使用する Elasticsearch のバージョンを Hibernate Search に伝える必要があります。

source: We need to tell Hibernate Search about the version of Elasticsearch we will use. It is important because there are significant differences between Elasticsearch mapping syntax depending on the version. Since the mapping is created at build time to reduce startup time, Hibernate Search cannot connect to the cluster to automatically detect the version. Note that, for OpenSearch, you need to prefix the version with `opensearch:`; see <<opensearch>>.
ja_jp: 使用するElasticsearchのバージョンをHibernate Searchに伝える必要があります。Elasticsearchのバージョンによってマッピング構文に大きな違いがあるので重要です。マッピングは起動時間を短縮するためにビルド時に作成されるので、Hibernate Searchはクラスタに接続してバージョンを自動的に検出することができません。なお、OpenSearchの場合は、バージョンの前に `opensearch:` を付ける必要があります; <<opensearch>>を参照してください。

source: We need to tell Hibernate Search about the version of Elasticsearch we will use. It is important because there are significant differences between Elasticsearch mapping syntax depending on the version. Since the mapping is created at build time to reduce startup time, Hibernate Search cannot connect to the cluster to automatically detect the version. Note that, for OpenSearch, you need to prefix the version with `opensearch:`; see xref:opensearch[OpenSearch compatibility].
ja_jp: 使用するElasticsearchのバージョンについて、Hibernate Searchに伝える必要があります。バージョンによってElasticsearchのマッピング構文に大きな違いがあるため、重要です。マッピングは起動時間を短縮するためにビルド時に作成されるため、Hibernate Searchはクラスタに接続してバージョンを自動検出することはできません。なお、OpenSearchの場合、バージョンの前に `opensearch:` を付ける必要があります。 xref:opensearch[OpenSearchの互換性] を参照してください。

source: We need to tell users what resources are required for completing the tutorial.
ja_jp: チュートリアルを完了するために必要なリソースをユーザーに伝える必要があります。

source: We need to write the entity into the database in a transaction.
ja_jp: トランザクションでエンティティーをデータベースに書き込む必要があります。

source: We noticed a last minute issue with IDEs today related to a new annotation processor we introduced.
ja_jp: 導入した新しいアノテーションプロセッサに関連して、本日、直前になってIDEで問題が発生しました。

source: We now can add a simple REST endpoint (`aggregator/src/main/java/org/acme/kafka/streams/aggregator/rest/WeatherStationEndpoint.java`), which invokes `getWeatherStationData()` and returns the data to the client:
ja_jp: これで、 `getWeatherStationData()` を呼び出してクライアントにデータを返すシンプルな REST エンドポイント ( `aggregator/src/main/java/org/acme/kafka/streams/aggregator/rest/WeatherStationEndpoint.java` ) を追加することができます。

source: We now can build the `producer` and `aggregator` applications:
ja_jp: これで、 `producer` と `aggregator` のアプリケーションをビルドすることができます:

source: We now deploy containers that are ~50MB, down from 200MB. That goes a long way for cluster density but also saves a ton of money on cluster nodes.
ja_jp: これまで200MBだったコンテナのサイズは、現在では50MB程度にまで縮小されました。これは、クラスターの密度を高めるだけでなく、クラスター・ノードのコストを大幅に削減することにもつながります。

source: We now have a separate JAXP extension. Until now, it was intertwined with the JAXB extension.
ja_jp: JAXP のエクステンションを別に用意するようになりました。今までは JAXB エクステンションと絡み合っていました。

source: We now know that we can create way more virtual threads than platform threads. One could be tempted to use virtual threads to perform long computations (CPU-bound workload). This is useless if not counterproductive. CPU-bound doesn't consist in quickly swapping threads while they need to wait for the completion of an I/O but in leaving them attached to a CPU-core to actually compute something. In this scenario, it is useless to have thousands of threads if we have tens of CPU-cores, virtual threads won't enhance the performance of CPU-bound workloads.
ja_jp: 私たちはプラットフォームスレッドよりもはるかに多くの仮想スレッドを作成できることを知っています。長い計算を行うために仮想スレッドを使いたくなるかもしれません（CPUバウンドワークロード）。これは逆効果とまでは言いませんが無駄になります。CPUバウンドとはI/Oの完了を待つ間にスレッドをすばやくスワップすることではなく、実際に何かを計算するためにスレッドをCPUコアに接続したままにしておくことです。このシナリオでは数十個のCPUコアに対して数千個のスレッドを持つことは無意味であり、仮想スレッドがCPUバウンドワークロードの性能を向上させることはありません。

source: We now know we can create more virtual threads than platform threads. One could be tempted to use virtual threads to perform long computations (CPU-bound workload). It is useless and counterproductive. CPU-bound doesn't consist of quickly swapping threads while they need to wait for the completion of an I/O, but in leaving them attached to a CPU core to compute something. In this scenario, it is worse than useless to have thousands of threads if we have tens of CPU cores, virtual threads won't enhance the performance of CPU-bound workloads. Even worse, when running a CPU-bound workload on a virtual thread, the virtual thread monopolizes the carrier thread on which it is mounted. It will either reduce the chance for the other virtual thread to run or will start creating new carrier threads, leading to high memory usage.
ja_jp: 私たちは、プラットフォームスレッドよりも多くの仮想スレッドを作成できることを理解しました。このため、長時間の計算 (CPU バウンドワークロード) をするために仮想スレッドを使用したいと考えるかもしれません。 しかし、これは無意味であり、逆効果です。 CPU バウンド処理は、I/O の完了を待つ間にスレッドをすばやく切り替えるのではなく、 スレッドを CPU コアにアタッチして何らかの計算を行うものです。 このようなケースでは、数十個の CPU コアに対して数千個のスレッドを持つことは非常に無意味で、仮想スレッドが CPU バウンドワークロードのパフォーマンスを向上させることはありません。 それどころか、仮想スレッド上で CPU バウンドワークロードを実行すると、仮想スレッドがマウントされているキャリアースレッドをその仮想スレッドが独占してしまいます。 その結果、他の仮想スレッドが実行される機会が減るか、新しいキャリアースレッドが次々に作成されることになり、メモリー使用量が増大してしまいます。

source: We now need to write a web page with links to all our APIs, as well as a way to register a new user, login, and logout, in `src/main/resources/META-INF/resources/index.html`:
ja_jp: 次に、すべてのAPIへのリンクと、新規ユーザー登録、ログイン、ログアウトを行うためのWebページを `src/main/resources/META-INF/resources/index.html` に記述する必要があります。

source: We often need to configure differently our application depending on the target _environment_. For example, the local development environment may be different from the production environment.
ja_jp: 多くの場合、ターゲットの _環境_ に応じて、アプリケーションを異なる方法で設定する必要があります。たとえば、ローカルの開発環境は本番環境とは異なる場合があります。

source: We often need to configure our application differently depending on the target _environment_. For example, the local development environment may be different from the production environment.
ja_jp: 私たちはしばしば、ターゲット _環境_ に応じてアプリケーションを異なるように設定する必要があります。たとえば、ローカルの開発環境と本番環境は異なるかもしれません。

source: We only added this annotation (and the associated import of course).
ja_jp: このアノテーション(もちろん関連するインポートも)を追加しただけです。

source: We only released the Core artifacts of 2.2.0.Final and not the full Platform release because this version suffered from a bug preventing dev mode to work on Windows (that's what you get for trying to fix another bug...). Thus why we announce 2.2.1.Final directly.
ja_jp: 2.2.0.FinalはWindowsで開発モードが動作しないというバグがあったため、Platformの完全版ではなくCoreの成果物のみをリリースしました（別のバグを修正しようとした結果です...）。そのため、2.2.1.Finalを直接公開しています。

source: We only support defining the `@PersistenceUnit` for model classes at the package level, using the `@PersistenceUnit` annotation at the class level is not supported in this case.
ja_jp: モデルクラスの `@PersistenceUnit` はパッケージレベルで定義することのみサポートしています。この場合、クラスレベルで `@PersistenceUnit` アノテーションを使用することはサポートされていません。

source: We open the file using the `open` method. It returns a `Uni<AsyncFile>`
ja_jp: `open` メソッドを使ってファイルを開きます。このメソッドは `Uni<AsyncFile>` を返却します。

source: We plan to bridge the existing Quarkus Micrometer extension metrics to OpenTelemetry in the future.
ja_jp: 今後、既存の Quarkus Micrometer エクステンションメトリクスを OpenTelemetry にブリッジする予定です。

source: We plan to retire the UBI 8 images for Quarkus in March 2026.
ja_jp: 2026年3月に Quarkus 用 UBI 8 イメージの提供を終了する予定です。

source: We point to the custom `AnalysisConfigurer` which defines the configuration of our analyzers and normalizers.
ja_jp: 私たちのアナライザーとノーマライザーの構成を定義するカスタム `AnalysisConfigurer` を指します。

source: We pre-boot as many of the frameworks as possible during the native compilation of a Quarkus application. It means that the resulting native executable has already run most of the startup code and serialized the result into the executable: even faster startup!
ja_jp: Quarkus アプリケーションのネイティブコンパイル中に、可能な限り多くのフレームワークをプリブートします。これは、結果として得られるネイティブ実行可能ファイルが、起動コードのほとんどをすでに実行し、その結果を実行可能ファイルにシリアライズしていることを意味します。これにより、起動がさらに高速になります。

source: We prefer listing services explicitly as it produces better optimised binaries. Disable it as well by setting `-H:-UseServiceLoaderFeature`.
ja_jp: より最適化されたバイナリを生成するために、明示的にサービスをリストアップすることをお勧めします。 `-H:-UseServiceLoaderFeature` により、これを無効にすることも可能です。

source: We provide automatic instrumentation for JVM metrics and HTTP server requests metrics according to the https://github.com/eclipse/microprofile-telemetry/blob/2.0/spec/src/main/asciidoc/metrics.adoc[Microprofile Metrics 2.0 specification].
ja_jp: Quarkus では、 https://github.com/eclipse/microprofile-telemetry/blob/2.0/spec/src/main/asciidoc/metrics.adoc[Microprofile メトリクス 2.0 仕様] に従って、JVM メトリクスと HTTP サーバー要求メトリクスを自動計装します。

source: We provide signal agnostic configurations for the connection related properties, meaning that you can use the same properties for both tracing and metrics when you set:
ja_jp: 接続関連のプロパティには、シグナルに依存しない設定を提供しています。つまり、設定時にトレースとメトリクスの両方に同じプロパティを使用できます：

source: We put some context around what `@ApplicationScoped` means, without going into details about alternative CDI lifecycles
ja_jp: 代替の CDI ライフサイクルに関する詳細には触れずに、 `@ApplicationScoped` が何を意味するのかについて、いくつかのコンテキストを示しています。

source: We really liked the fact that Quarkus uses JAX-RS, which we were already familiar with. Having out-of-the-box integration with https://quarkus.io/guides/resteasy-reactive[RESTEasy reactive^] was a nice performance bonus, and the https://quarkus.io/guides/openapi-swaggerui[OpenAPI extension^] available in Quarkus made it pretty simple to expose the API as a Swagger API browser with no additional work needed.
ja_jp: QuarkusがJAX-RSを使用していることは非常に気に入っています。私たちがすでに慣れ親しんでいることだからです。また、Quarkusで利用できる link:https://quarkus.io/guides/openapi-swaggerui[OpenAPIエクステンション^]により、追加作業なしでAPIをSwagger APIブラウザとして公開することが非常に簡単になりました。

source: We receive a _name_ as a query parameter
ja_jp: クエリパラメータとして _name_ を受け取ります。
